Revit 2024 API
BuiltInFailures.CopyMonitorFailures.LevelDeletedSameName Property
 Level cannot be copied because level with desired name '[Name]' already exist in a target document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LevelDeletedSameName { get; }
Visual Basic
Public Shared ReadOnly Property LevelDeletedSameName As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LevelDeletedSameName {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyMonitorFailures Class
Autodesk.Revit.DB Namespace